
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        5 |           5 |          0 |
## Affected resources by action

|  Action  | Resources                                                                           |
|:--------:|:------------------------------------------------------------------------------------|
|    🟢    | `module.management.aws_vpc_endpoint.s3`                                             |
|    🟢    | `module.management.aws_vpc_endpoint_route_table_association.example["10.0.0.0/24"]` |
|    🟢    | `module.management.aws_vpc_endpoint_route_table_association.example["10.0.1.0/24"]` |
|    🟢    | `module.management.aws_vpc_endpoint_route_table_association.example["10.0.2.0/24"]` |
|    🟢    | `module.management.aws_vpc_endpoint_route_table_association.example["10.0.3.0/24"]` |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                                    |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                           |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                                      |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website`         |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`           |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "17" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ image_id                             = "ami-02f2920ba1d21ece8" -> "ami-0615a53b3317b7031"
      ~ latest_version                       = 17 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.management.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name"        = "S3 Endpoint in management VPC"
          + "environment" = "production"
          + "service"     = "management"
        }
      + tags_all              = {
          + "Name"        = "S3 Endpoint in management VPC"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "service"     = "management"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-08e19d859c26d18b2"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.management.aws_vpc_endpoint_route_table_association.example["10.0.0.0/24"] will be created
  + resource "aws_vpc_endpoint_route_table_association" "example" {
      + id              = (known after apply)
      + route_table_id  = "rtb-04a16e74d5b12a338"
      + vpc_endpoint_id = (known after apply)
    }

  # module.management.aws_vpc_endpoint_route_table_association.example["10.0.1.0/24"] will be created
  + resource "aws_vpc_endpoint_route_table_association" "example" {
      + id              = (known after apply)
      + route_table_id  = "rtb-067c30e65dd4108e9"
      + vpc_endpoint_id = (known after apply)
    }

  # module.management.aws_vpc_endpoint_route_table_association.example["10.0.2.0/24"] will be created
  + resource "aws_vpc_endpoint_route_table_association" "example" {
      + id              = (known after apply)
      + route_table_id  = "rtb-0ac1c23091a58b0bd"
      + vpc_endpoint_id = (known after apply)
    }

  # module.management.aws_vpc_endpoint_route_table_association.example["10.0.3.0/24"] will be created
  + resource "aws_vpc_endpoint_route_table_association" "example" {
      + id              = (known after apply)
      + route_table_id  = "rtb-032c75541921bd8f1"
      + vpc_endpoint_id = (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "19" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (12 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-0163aebbfba1c3532" -> "ami-0ffac974ce31b438a"
      ~ latest_version                       = 19 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 5 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDUsICJjaGFuZ2UiOiA1LCAiZGVzdHJveSI6IDB9fQ==
```
</details>